[
  [
    {
      "id": "cmirzzjpz0001a6oo96iga5sj",
      "capsuleId": "cmirzziix0000a6oosc1gwyxr",
      "title": "The Accountability Protocol eBook",
      "content": "The Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n\nForeword\nAccountability is the single greatest differentiator between top performers and\neverybody else.\nThis book details The Accountability Protocol, a simple and subtle method that will\nmassively improve your own accountability, and that of your team.\nThe Protocol focuses entirely on what you can do. You will always have the initiative to\nimprove the accountability between yourself and your colleagues, customers, and\nothers.\nWelcome\nWelcome to version 2 of The Accountability Protocol: a method for setting and\nmanaging expectations and its enabling tool, the Accountability Loop.\nBy the end of this book, you'll have learned the behaviors needed to increase your own\naccountability to others—and to kindly and assertively ask others to be more\naccountable as well.\nLet’s define “Accountability.”\nWhen I promise to do something for you, I'm creating an expectation.\nAccountability occurs when you and I both agree that this expectation has been met\nor handled. An expectation can be handled in any of three ways:\n1. I did what you understood me saying I would do.\n2. We re-negotiated to a new expectation that I then met.\n3. We unwound that expectation in a way that worked for us both.\nSome examples:\n1. You ask me to pass the salt; I say “yes” and pass you a salt shaker; you thank me.\n2. You ask me to pass the salt; I say “yes” but then discover we’re out, so I offer you\nour low-sodium salt substitute; you accept this and thank me.\n3. You ask me to pass the salt; say “yes” but then discover we’re out and apologize;\nyou accept this with good grace.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 1 of 47\n\n-- 1 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nAny other outcome isn't an accountable outcome:\n1. We disagree over what was promised.\n2. We disagree over what was delivered (and whether it met expectations).\n3. I simply fail to perform without unwinding or renegotiating.\n4. You fail to accept what I do without unwinding, renegotiating, or a hot wash.\nHere are some non-accountable examples:\n1. You ask me to pass the salt; you think I said “yes” but I later deny that I did; you\ndon’t receive salt; we disagree about whether I ever promised you salt.\n2. You ask me to pass the salt at lunch; I say “yes” then hand you some rock salt for\nde-icing a sidewalk; we then disagree about whether I did what you asked.\n3. You ask me to pass the salt; I say “yes” but do nothing.\n4. You ask me to pass the salt; I pass you something I think is salt; you profess\ndissatisfaction but never explain why or give me a chance to fix the problem.\nThere are a near-infinite number of ways for expectations to fail. This book shows you\n39 major ways two people can:\n● mis-set expectations\n● undermine performance\n● fail to clarify vagueness\n● fail to renegotiate\n● fail to unwind\n● fail to learn\nAnd, we'll equip you with behaviors, techniques, and Job Aids (checklists and other\ntools) to help you create and sustain Accountability for yourself and all those with whom\nyou work.\nWhy master Accountability?\nAccountability strikes at the heart of both performance problems and morale\nproblems.\nExercise:\nThink about a time someone really let you down at work.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 2 of 47\n\n-- 2 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nPick a specific incident.\nWhat was that like? How did it feel?\nWhat thoughts ran through your mind?\nHow did this let-down change your opinion of the person(s) who let you down?\nUse the Wheel of Emotions below to describe exactly what this felt like. Take your time\nand find as many precise emotions as you can that describe this scenario.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 3 of 47\n\n-- 3 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nEveryone hates being let down\nFor most people, being let down is one of the biggest problems at work. Here's a real\nexample from a student:\nExpectation that was set: I was asked to create a simple CRM spreadsheet to\npresent at our business development working meeting.\nWhat actually happened: I worked over the weekend on it. During the meeting the\nfollowing week, my work was ignored (not reviewed) and another solution was\npresented—by the person who asked me to create my solution.\nHow this person felt: Disempowered. Like I wasted time. Disrespected. Frustrated.\nWhile the specific details vary widely, this person's emotional experience is typical. Low\nAccountability and mismatched expectations are a huge source of drama, ill will, low\nmorale, damaged trust, and self-inflicted chaos in the workplace.\nHere are a few more answers students gave when asked, “What was the impact of your\nspecific example of Low Accountability?”\n● Time wasted\n● Not meeting KPIs\n● Customer dissatisfaction and lost revenue\n● Loss of revenue and customer goodwill\n● Feelings of inadequacy\n● Loss of respect and trust for my organization\n● High stress, having to re-prioritize to-do list\n● Frustration\n● You lose motivation to excel\n● Spent time I didn't have.\n● Morale drops among staff. We even had staff that wouldn't volunteer to help with\nother projects after their experience.\n● Stressed, frustrated\n● Frustrated, or like working relationship has been damaged\n● Embarrassed\n● Frustration over participation, always asking how we/I can improve this\n● Looking for a new job\n● My trust is gone\n● Disheartened\n● It makes me question their work ethic\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 4 of 47\n\n-- 4 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n● It's hard when you see it going on but are not in a position to approach the higher\nups and explain why the miscommunication happened\n● Disappointed\n● Frustrated and running out of options to keep this employee on my team\n● Undervalued for contributions\nEveryone Loves High Accountability\nAnd at the same time, experiencing an example of High Accountability is wonderful.\nHere are those same students, describing what this was like for them:\n● Pride\n● I was very grateful and they enjoyed helping me out.\n● We all sacrificed, which led to great team bonding.\n● Checking item off the list, one less thing to worry about, gratefulness\n● The team felt united\n● Gratitude\n● Pride all around\n● Employees awarded with Kaizen during plantwide meeting. I was astounded that\nthey could pull that off. Sense of pride and ownership.\n● pleased and surprised\n● Business partnership is stronger, feels good to ask for that thing again, knowing\nhow to ask for it or when\n● We felt capable of overcoming anything we put our minds to.\n● Accomplishment\n● Communications were open and direct which moved the project faster and we felt\nvery successful at the end.\n● Ownership\n● Sense of purpose\n● My Boss said I did an amazing job on training someone. Impact for us was we\ndidn't have to watch over their shoulder the whole time and then I can move on\nto something else to make the work to go faster.\n● Great\nThe point is, Low Accountability creates lousy results and a low-morale work\nenvironment. The best people leave, and good people don't want to join.\nHigh Accountability creates great results and an energized, high-morale work\nenvironment. The best people stay, and good people are eager to join.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 5 of 47\n\n-- 5 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nYour people are looking to YOU to create a culture of High Accountability. It may be the\nmost important thing you ever do as a leader. Our goal is to give you the tools to do this.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 6 of 47\n\n-- 6 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nPreconditions for Accountability\nWe know that we have Accountability when the Doer and the Asker both agree the Doer\ndid what the Asker asked for.\nSimple as this sounds, it won’t happen on its own -- preconditions must exist. Here are\nthe biggest. A more detailed treatment of Preconditions is covered in Appendix I.\nOwnership or Roles\nBefore you embark on an Accountability journey, be sure your roles are clear. If you see\nproblems with Accountability, check for role clarity and ownership of results.\nBasic Trust\nThe Accountability Protocol only works when the Asker and Doer have some baseline\nlevel of mutual trust. This level of basic trust doesn’t need to be all that high. Even\npeople who might normally mistrust each other can still come together and cooperate\neffectively. (Think of the World War I Christmas cease-fires that happened\nspontaneously up and down the trenches.)\nClarity (and Context)\nIn his book Conversations for Action (the inspiration for The Accountability Protocol),\nFernando Flores referred to the need to share a “context of obviousness.”\nThe Asker and the Doer need to share enough clarity and context to understand the\nrequests being made and the agreement or expectation they are creating.\nIf you see problems with Accountability, and the two actors have perhaps never worked\ntogether or haven’t done this task before, check for a lack of clarity around context.\nMental Fitness (non-victimhood)\nFor as long as neither of our actors -- Asker and Doer -- are in a Victim or other\nSabotaged state (they are in Neutral or Sage mode), the Accountability Protocol can\nalways be made to work.\nIf both are Sabotaged, the Accountability Protocol is unlikely to work. (But with\npractice, it’s possible.)\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 7 of 47\n\n-- 7 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nIn other words, a precondition for reliable usage of the Accountability Protocol is that\nthe two actors be Neutral or better. If you see breakdowns, you may need to check for\nSabotage.\nDoability\nThe work being requested by the Asker must be Doable by the Doer.\nAn optimistic or naive Doer (or one who has been hijacked by a Pleaser Saboteur and is\nmotivated to please rather than to make a well-grounded commitment) may say “yes”\ndespite the non-doability of the task, or before confirming doability.\nSee the chapter on the Negotiate phase, where Doability must be confirmed.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 8 of 47\n\n-- 8 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nOverview of the Accountability Loop\nTo create a Culture of High Accountability—or even to just raise your own, or effectively\ncoach someone else to raise theirs—you must understand the hidden structure\nunderlying all forms of Accountability.\nAccountability is structured as a Loop.\nThe Accountability Loop consists of four major phases:\n● Initiate\n● Negotiate\n● Perform\n● Accept\nThis structure holds for all instances when two people agree that one of them will do\nsomething for the other.\nHere's what happens in each Phase.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 9 of 47\n\n-- 9 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nInitiate\nOne person takes on the Role of Asker. As Asker, they declare a desire for an outcome or\nactivity. This declaration creates a new possibility in the world. The artifact that marks\nthe end of this Phase is the “Request for Performance.”\nNegotiate\nThe second person takes on the Role of Doer. They respond to the Asker's Request by\nindicating a willingness to enter dialog, and the two parties engage in Negotiation.\nDuring this Phase, the two should surface the Asker's \"Conditions of Satisfaction\" that, if\nmet, would complete the Loop. They also need to surface the Doer's \"Needs and\nConstraints\" that will empower the Doer to Perform. This conversation creates an\nexpectation. The artifact that marks the end of this Phase is the “Mutual Agreement\nof Performance.”\nPerform\nThe Doer now engages in the work. They may need to ask clarifying questions of the\nAsker, and events may force a renegotiation. The Doer may also become an Asker and\nenlist the help of subcontractors or helpers. This opens Sub-Loops that nest inside the\nmain Loop. This work creates results in the world. The artifact that marks the end of this\nPhase is the \"Report that Performance is Complete.\"\nAccept\nThe Asker has been notified and is now expected to examine the work product and\ninform the Doer if indeed the Conditions of Satisfaction have been met. They may ask\nfor re-work, which can re-open Negotiation. The two parties can each look at how they\ncontributed to the outcome and how each can do better in the future. If the experience\nharmed their working relationship, repair may be called for. The artifact that marks the\nend of this Phase is the \"Report that Performance is Accepted.\" (Note that\nperformance can also be rejected at this point.)\nEach of these Phases has Best Practices\nIn the pages that follow you'll be able to learn the best practices of creating High\nAccountability, phase by phase.\nAccountability Creates Coordination\nYou fix coordination issues by:\n1. Making explicit requests\n2. Making explicit promises (commit, decline, or counter-offer)\n3. Tracking commitments clearly; and\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 10 of 47\n\n-- 10 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n4. Recognizing and addressing breakdowns explicitly and courageously.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 11 of 47\n\n-- 11 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nPhase 1: Initiate\nWhen one person Initiates a request for another person to take an action, that first\nperson takes on the Role of Asker. The other person takes the Role of Doer.\nThis phase culminates in an artifact: a Request for Performance. This may take the\nform of an email, a spoken request, etc.\nBefore the Request occurs, this Loop has not yet sprung into existence. It is only a\nthought in the Asker's mind.\nOnce the Request is stated, there is now a declaration of a new possibility.\nEven if nobody has yet stepped up to be Doer, the Asker has created a new tension in the\nworld, between their words, and their unmet desired outcome.\nWhen John F. Kennedy declared...\nI believe that this nation should commit itself to achieving the goal, before\nthis decade is out, of landing a man on the moon and returning him safely\nto the Earth.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 12 of 47\n\n-- 12 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n...nothing had yet happened, other than a massive setting of new expectations.\nInitiating well is very powerful. It deserves to be done with care.\nBest Practices of Initiating\nHere are the best practices of Initiating. These are things Askers can do to create higher\nlevels of Accountability.\n● Gather the facts together first\n● Repeat work? Use a template or checklist specific to this task\n● Clarify Effort vs Outcome requests (exploratory vs proven methods)\n● Share context so others can make smart tradeoffs\n● Clarify your Ultimate Outcome (explain how you will make use of the work\nproduct)\n● Describe it Visually\n● Specify delivery format and method\n● Ask for interim work products, status reports, samples\nThe most common failure modes in the Initiate phase are:\n1. Get it Off my Plate Already - the Asker is impatient, more focused on\nreducing their mental burden than in setting the Doer up for success.\n2. Read my Mind - the Asker assumes the Doer thinks the same way the Asker\ndoes, and Initiates in a way that discourages dialog during Negotiate. (When\nthe two work together routinely, or share a context of indoctrination—e.g. they\nboth graduated from West Point—that can work. But it's dangerous to assume;\nbetter to \"trust but verify\"—which means, to Initiate in a way that invites the\nDoer to verify details during Negotiate.)\n3. Pass the Buck - the Asker is eager for someone else to take the blame for\nincipient failure. This is an \"unclean Ask\" because the Asker is not truly\ndesiring the work to be done, so much as they are seeking to avoid blame by\noffering up a Doer as a human sacrifice, usually to an unreasonable boss or\ncustomer.\n4. Micro Request - the Asker asks for something so small that it takes longer to\ndiscuss the request than to do the work. Wasteful on its face, this failure mode\nmay hint that the Asker doesn’t trust the Doer with larger tasks, or the Asker is\nusing the request as a power play—to demonstrate to the Doer that the Asker can\nmake them do things.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 13 of 47\n\n-- 13 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nPhase 2: Negotiate\nThe Negotiate Phase is critical to success with an Accountable Agreement. Whichever\nrole you play, Asker or Doer, you've got a stake in a good Negotiation.\nBest Practices when you are the Asker:\n● Do I want an Outcome or an Effort?\n● Separate the Outcome from the Method\n● Is the counter-offer OK?\n● Are they visualizing what I’m visualizing?\n● Ask for early updates\n● Give Context\n● Challenge a weak YES\nBest Practices when you are the Doer:\n● Do I know a better way?\n● No weak YESes!\n● What else am I doing?\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 14 of 47\n\n-- 14 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n● Can I commit to an Outcome, or only to Effort?\n● Offer visualizations and early updates\n● Commit-to-Commit and Conditional Yes\nBest Practices when you are the Asker\nDo I want an Outcome or an Effort?\nBy \"Outcome\" we mean \"a well defined result.\" By \"Effort\" we mean \"a given amount of\nwork time.\" If you ask your child \"please mow the lawn\" that's asking for an Outcome. If\nyou ask your child \"please spend 30 minutes mowing the lawn\" that's asking for Effort.\nWhenever you have a known problem with a known solution, it's usually better to\nask for an Outcome rather than for Effort. (Workers mostly enjoy finishing things they\ncan feel good about, and Outcomes provide that.)\nBut when you're in a more exploratory space—say the yard is new, and we don't know\nhow long it takes to mow it—asking for a well-defined amount of Effort is safer for the\nDoer and wiser for both parties. As the Asker, you can look at the partially mowed lawn\nafter 30 minutes and estimate the total work much better than you could before any\neffort was made.\nIf you have a well functioning sales process and a trained salesperson, you can ask the\nsalesperson to \"sell 10 cars this week\" and you both know it's a reasonable request. But\nif you are still figuring out your sales process (or the person is in training), it can be\nbetter to ask for a given amount of effort, as in \"sell cars for five days this week using the\nnew process, and report back on what your experience was.\"\nSeparate the Outcome from the Method\nSometimes we simply want an Outcome (sales of cars), and other times we want both an\nOutcome (clean room operations) and to dictate the Method the Doer uses.\nAsking for use of a given Method is mostly appropriate in Six Sigma or similar\nenvironments where there's strong process discipline, and it's important that the Doer\nfollow an SOP (Standard Operating Procedure).\nIn other cases, such as when Doers have expertise and when the environment is more\ncomplex or emergent and the worker needs to use judgment, it's better to NOT specify\nthe Method too tightly. When the Asker gives the Doer some room for creativity and\ninitiative, the Doer is free to find better methods, and the Asker keeps their focus on\ntheir true goal, the Outcome.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 15 of 47\n\n-- 15 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n(We should always have clear boundaries around what a Doer must not do, e.g.\nprohibitions on unsafe, illegal, or unethical behavior.)\nIs the counter-offer OK?\nExpect as Asker that the Doer may make a counter-offer. Be open to this, but don't say a\n\"yes\" you don't really mean.\nAre they visualizing what I’m visualizing?\nAs George Bernard Shaw put it, \"The single biggest problem in communication is the\nillusion that it has taken place.\"\nTake the time to describe your desires so clearly that you both can visualize that desire.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 16 of 47\n\n-- 16 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nJust because you're asking for a horse and everyone is smiling and nodding, doesn't\nmean they're also visualizing a horse.\nDon't rely on language unless you have reason to believe you share definitions. There's a\njoke that the verb \"to secure\" means very different things across the US Armed Forces.\nWhen told to \"secure that building\"...\n● ...the Army would assault it from the front and sides with a company of soldiers\n● ...the Marines would assault it from the top by dropping a squad of soldiers from\na helicopter\n● ...the Navy would send a yeoman with a flashlight and a keyring to lock all the\ndoors\n● ...the Air Force would acquire a 5-year lease with the option to purchase\nIt's OK during Negotiate for the Asker to ask, especially if the Doer seems overly\nconfident or vague, \"please describe what you're hearing me say that I want.\"\nThe point here is not to shame the Doer for hearing you incorrectly. Your attitude\nshould be, \"I know what I intended to ask for, but I need to know what you thought you\nheard.\" Half of the point of Negotiation is to close the gap between what the Asker\nthought they asked for, and what the Doer thought they heard.\nAnother good question is:\n● If a video camera were recording you delivering the result, what would it see?\nTime spent here is especially useful when the Asker and Doer are collaborating on\nsomething the two of them haven't done together before.\nAsk for early updates\nThis technique, like the Visualizing step, reduces mistakes by catching them early.\nFor example, if assigning a large task due in a week, it's reasonable to ask the Doer to\ngive you within 24 hours their intended work breakdown or list of tasks and steps. Don't\nmake this onerous; a list jotted on a napkin could be enough to clarify mutual\nunderstanding.\nYour goal as Asker is to look over this early update and see if it reveals some previously\nhidden misunderstanding between you and the Doer.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 17 of 47\n\n-- 17 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nGive context\nAskers often forget how important it is for the Doer to understand what your situation\nis—what the Context of your request is. When the Doer knows how you're going to use\nthe work product they're creating for you, they can often do it much better.\nIf you're buying pants and ask for cotton, don't be afraid to also share the fact that you're\nplanning to wear them on a hike next week. Your Doer may know reasons why cotton is\nthe worst fabric for next week's weather, and be able to direct you to something better.\nIf you want a report, make sure your Doer knows how you'll be using the report.\nSuppose you ask for \"a report\" and what you really need is a one page summary with key\nstatistics in a graph, to go over with your boss. And suppose your Doer hears \"report\"\nand gives you, at the last minute, a 20 page essay style report with data tables but no\ngraphs. It's like buying Ikea furniture—you have some assembly ahead of you before you\ncan use what you get. Better to say \"a one page report I can go over with my boss in 5\nminutes\".\nChallenge a weak YES\nAs Chris Voss writes in Never Split the Difference, there are three ways people say YES:\n● The Confirmation YES - I confirm the truth of a statement.\n○ Example: “Yes, it’s raining now.”\n○ This is a weak YES.\n● The Commitment YES - I willingly accept the moral burden of having you\nexpect me to do this thing, and I truly intend to do it.\n○ Example: “Yes, I’ll pick the kids up from school today at 2 PM.”\n○ This is the only strong YES.\n● The Counterfeit YES - I deceive you into believing I’ve given you a\nCommitment YES, but I actually have no intention of doing the task, or I haven’t\nbothered to check whether it’s possible - I’m saying the word “yes” just to placate\nyou or postpone a hard conversation. Sometimes this is done unconsciously.\n○ Example: “Yes, I’ll pick the kids up from school today at 2 PM” (when I\nhave no idea if I can, or if I already know I can’t).\n○ This is a weak YES\nTo be Accountable, you should not give a Counterfeit YES and you must challenge any\nYES that you wonder might be Counterfeit. A Confirmation YES is meaningless as a\nform of commitment.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 18 of 47\n\n-- 18 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nA person using “malicious compliance” can give a Confirmation YES and fool an Asker\ninto thinking they received a Strong YES.\nBest Practices when you are the Doer\nDo I know a better way?\nAs the Doer, consider whether you know of better ways to proceed. Don't let the Asker\ndictate your Method if that's not appropriate. If you're not clear, or if the Asker seems to\nwant you to go a way that you feel isn't best, explicitly ask the Asker whether they are\nwilling to give you leeway to use your own judgment on the Method.\nIf the Asker seems determined to force you to use a Method you don't believe in, you\nhave options. You can for example say \"If I do it my way, I will guarantee the results. If\nyou insist I do it your way, I cannot take responsibility for the outcome; I can only offer\nyou my best effort.\" You can also refuse to perform a task in a way you feel is wrong.\nJust be clear what the basis is for your refusal—saying \"I cannot agree to use a Method I\nthink will be harmful\" is ethically sound, but merely saying \"I don't want to use your\nMethod\" can come across as contrary, willful, or insubordinate.\nNo weak YESes!\nA \"Weak YES\" is any positive response to an Initiation, that serves to cut short\nNegotiation before all the needed information is exchanged.\nNo matter whether you're the Asker or the Doer, beware of Doers (including yourself)\nwho say \"YES\" too quickly, without asking enough questions to actually understand the\nwork. If the Doer hasn't received enough information to actually understand what\nthey're supposed to do, they are unable to give informed consent—their \"yes\" answer is\nnot grounded in facts and understanding.\nWhen this happens, it's often because the Doer feels obligated to say \"yes\" regardless of\ncircumstances, or is trying to signal loyalty, or subordination, or a willingness to help.\nAs the Asker, never accept a weak \"yes\". It's unethical to collude in creating an\nagreement you don't have reason to believe can be fulfilled.\nAs the Doer, never give a weak \"yes\". It's bad practice (and hurts your reputation) to\nrepresent to the Asker that you can do something, before you've gathered the\ninformation to be confident you can, in fact, do it. The Doer who repeatedly gives weak\nyeses will soon be mistrusted.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 19 of 47\n\n-- 19 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nA better way for the Doer who wants to signal willingness, is to use the\nCommit-to-Commit or the Conditional Yes moves described below. Or, one can\nalso simply say “I’m excited to learn all the details so I can give you a clear\ncommitment.”\nException for Delegation\nIf your boss asks you to accept a delegation, it is appropriate to say ‘yes’ early, when you\ntrust that your boss will then follow up with the implementation details you need. The\nboss doesn’t want to enter a lengthy Negotiation with a reluctant subordinate who might\nend the Phase with a ‘no’. Delegation from your boss is development; it’s how you grow.\nWhat else am I doing?\nWhen you are in the Role of Doer, you already have other commitments. You may have\navailable time to take on new work... or you may not. Do NOT enter into a new\ncommitment without checking to see how it will impact existing commitments. This can\nsound like, \"Boss, I'm willing to do this, however I'm fully booked—can you help me\ndecide which of my other commitments can be delayed so I can work on this?\"\nIf you are Asker, look for evidence of the Doer verifying they have the time to help you.\nCan I commit to an Outcome, or only to Effort?\nAs Doer, be alert to Askers wanting you to commit to an Outcome (a definite result) in\na circumstance where you can, ethically, only commit to making an Effort.\nBy Outcome vs Effort here, we mean the difference between promising to \"sell $1m of\nproduct in Q3\" (an Outcome) vs promising to \"contact 10 new prospects a day for 90\ndays\" (an Effort).\nThere's some grey area here, but the biggest reason as a Doer for agreeing only to make\nan Effort is when you don't yet have a solid Method in place to produce reliable results.\nBy contrast, in sales especially, it's common to set quotas and otherwise rely on the skills\nand professionalism of the Doer to deliver the Outcome. We expect some Doers to come\nwith their own Methods.\nOffer visualizations and early updates\nAs Doer, notice if the Asker has not given you a clear Visualization (above) of the desired\nend state, and has not asked for any early updates or interim deliverables.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 20 of 47\n\n-- 20 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nAs Doer, you are well within your rights to insist on an early interim deliverable as a way\nto double check mutual understanding.\nCommit-to-Commit and Conditional Yes\nThese two underused moves can signal your willingness to satisfy the Asker, but keeps\nyou in Negotiation.\nThey can sound like:\n● “I can't commit yet, but as soon as I verify X, Y, and Z, I'll be in a position to\ncommit, and I’ll get back to you by 4 PM local time today with that information.”\n● “I can commit, on the condition that…”\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 21 of 47\n\n-- 21 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nPhase 3: Perform\nThe Perform phase is where the Doer finally starts to Do.\nThis is the phase where most people start to discover the problems that were created\nduring earlier phases. Perhaps the Initiate phase was too vague. Perhaps you failed to\nclarify something during Negotiate. Here in Perform is where you'll discover most of\nthose problems.\nThe best practices during Perform include:\n● Ask for the help you need.\n● Share bad news early. Be willing to re-set expectations when needed.\n● Be transparent (but don’t burden others). Share status.\n● Give the interim work products you promised\n● If I need clarification, a decision, or more info: ask in a structured way (described\nin the Warm ABCs section)\n● New risks arising? Discuss them and agree on mitigation.\n● Own your inputs!\n○ Never blame (to your Asker) a subcontractor, helper, or other sub-loop of\nyour own, even when they let you down\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 22 of 47\n\n-- 22 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n○ Always (in front of the Asker) take blame and responsibility for every\nhelper you enlist—you are always 100% responsible for everything they do,\nand fail to do\n○ Therefore, get helpers' inputs early (so you can fix or replace their inputs if\nthey fail) and monitor their status carefully\n● Be open to new information and possibly re-negotiating\n● Keep track of problems that could have been prevented by better Initiating or\nNegotiating.\nAsk for Help\nThis may not be a trap you fall into as a Doer, but plenty of Doers have this problem. (As\nAsker, watch out for your Doer falling in.)\nJust because you said you would do something, doesn't mean you have to do it yourself.\nAnd your pride of ownership in doing the work yourself, is less important to the Asker\nthan meeting the Asker's Conditions of Satisfaction.\nBad News Early\nI once had a boss who made it clear that he would never punish me for hitting a snag or\nencountering a problem... but if I concealed a problem from him, and that problem later\nhurt the client, he reserved the right to fire me for hiding bad news.\nYour Asker is probably a Doer for someone else. You may be supporting a sub-loop that\nyour Asker is taking ownership of. Just as you \"own your inputs\" (see above), by giving\nbad news early you allow your Asker to own theirs.\nTransparent but not Burdensome\nEveryone says they want transparency, but we also don't want to be burdened by a\nconstant stream of drama.\nIf I send you out for coffee, I don't need a stream of text messages about how long the\nline is, how rude the barista is, etc. Give me relevant updates, not every imaginable\nupdate.\nShare Status (as effortlessly as possible)\nDuring Perform you don't want to spend excessive time reporting on the work, even\nthough you need to keep your word to provide appropriate status reports.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 23 of 47\n\n-- 23 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nIdeally, find ways to include your Asker in the regular pattern of updates your team\nuses, or give your Asker read-only access to your internal tracker, or create an\nautomated report that sends your Asker only relevant updates, drawn directly from the\ntool you use to manage your tasks.\nSometimes you can share status just by inviting the Asker to attend a regular Friday\ndemo of completed work, as is popular in many Agile circles. (It's more impactful to\ndemo working code than it is to write a memo about code, plus the code is actually\nuseful while the memo is at best overhead. Think \"demo not memo.\")\nI urge you to avoid spending hours on highly polished status updates, except when truly\nneeded, such as keeping nervous stakeholders in-the-loop, or working in an\nenvironment where a high degree of polish is considered standard (e.g. some marketing\norganizations).\nIf you're unclear what your Asker really needs in an update, e.g. will they be bundling it\nup with other updates and sending it on to their boss, then ask.\nGive Interim Work Products\nBy now you've absorbed that the coordination issues that arise in all Accountable\nAgreements are pervasive and deeply harmful. You've noted that \"what the Asker\nthought they asked for\" may be disconnected from \"what the Doer thought they heard.\"\nThere is one excellent way to close this potential gap early. That is, for any project or\nRequest that will take N units of time (say, N = 10 weeks), negotiate for at least one early\ninterim deliverable no later than N/10 time units in. This early interim deliverable\nshould be a more-detailed elaboration of what you as Doer heard the Asker ask for, and\nperhaps an outline of how you were planning to go about delivering it.\nSome Requests may have a whole schedule of interim deliverables and work products\nthroughout. A home builder would start with a blueprint, then a site plan for a specific\nlocation, then more plans for key trades like an Electrical plan, Plumbing plan, HVAC\nplan, etc.\nBeware the Request of longer than a week that has no interim work products.\nAsk for Clarifications and Decisions with the \"Warm ABCs\"\nThis is so important that it gets its own chapter. For now, understand that there is a\ndetailed protocol, which you as Doer can and should customize, for asking for and\nreceiving clarifications and decisions from the Asker during the Perform phase.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 24 of 47\n\n-- 24 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nDiscuss Risks Routinely\nFor longer or larger Requests, consider creating a Risk Registry. Meet routinely with\nyour Asker to review these Risks and get onto the same page regarding how each will be\nhandled.\nOwn Your Inputs\nThe key to all Accountability is, you cannot delegate it or give it to a subordinate or\nsubcontractor in a sub-loop. Even when you've delegated the work, the accountability\nremains with you.\n● Never blame (to your Asker) a subcontractor, helper, or other sub-loop of your\nown for any delay or problem, even when they let you down.\n● Always (in front of the Asker) take blame and responsibility for every helper you\nenlist—you are always 100% responsible for everything they do, and fail to do.\n● Therefore, get helpers' inputs early (so you can fix or replace their inputs if they\nfail) and monitor their status carefully.\nThe ideal here is to emulate what West Point teaches cadets: that when you're in charge,\nyou are always fully responsible for everything your people do, and fail to do.\nBe Open to Change\nAs Doer, while you Perform you may come across better ways to do the work. Don't be\nshy about reopening dialog with the Asker about improving things.\nYour customer comes in with an old PC to repair. As you are diagnosing it you discover\nthat the repair would cost more than a new PC you'll have available next week. Bring\nthat up.\nAs Asker, during Perform you might be the one who finds a new and better path. Again,\nbe willing to renegotiate to create a better outcome.\nKeep a log of Problems\nKeep a log of problems or hiccups that were created or made worse by errors in Initiate\nand Negotiate. Did you create a printed report only to be told they wanted it emailed as\na PDF? And that never came up before you printed it? Did you create a PDF only to be\ntold they wanted Adobe Illustrator format?\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 25 of 47\n\n-- 25 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nI ordered printing for my North Side firm from a print shop with two locations, North\nSide and South Side. I called the only phone number from their website, and it rang\nthrough to South. I gave my order, and asked that they let me pick it up from the North\nSide location. No problem, I was told—they answer calls in South but do the printing at\nNorth. I explicitly said I wanted to pick up in North. Sure enough, when it was done they\ndidn't tell me it was ready, instead they automatically shipped it from their North to\ntheir South location (further away from me) because that's who I'd spoken with. Then\nthey wanted to charge me for shipping it back to North, where it had been created in the\nfirst place.\nAll of the examples you log (the more granular and detailed the better) should be\nreviewed during the Accept phase in order to fix future processes.\nThink of the expense caused by these problems as you paying a form of tuition. Logging\nthe problems is the first step to learning. It makes no sense to pay tuition for lessons and\nskip the lessons, only to pay again by repeating the problem. And repeat them you will,\nbecause you cannot learn deeply and reliably without taking good contemporaneous\nnotes (and having a good Lessons Learned process, covered in the Accept phase).\nReport Your Performance\nAlways remember as Doer to report that your Performance is complete, and do it in the\nway the Asker asked and you agreed.\nIn-Flight Corrections and the Warm ABCs\nSee video here\nDuring the Perform phase, as Doer you'll run into multiple occasions where you need to\nreconnect with your Asker. The most common reasons include clarifying prior\ninstructions, and asking for decisions about emergent situations.\nWhether it's a routine question (\"it's now time to pick the carpet color\") or unexpected\n(\"You specified Golden Oak but it's out of stock. May I substitute Alder?\"), it's\ncommonly the case that the project can become stuck if this \"in-flight correction\"\nconversation gets mis-handled or delayed.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 26 of 47\n\n-- 26 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nOne client of mine discovered that half his projects lost money, because his staff was\nstruggling to get clients to respond timely during the Perform phase. (They had no clear\nprotocol to use to go about asking, so their requests were vague and hard to\nunderstand.)\nWorse, the staff hadn't onboarded the clients (during Negotiation) to the policy of\ncharging late fees for client-caused delays. So when clients made projects late, driving\ncosts up for my friend, his staff were afraid to tell clients that their delays would result in\nlate fees. So, the fees were never collected—the firm just ate these extra expenses, hence\nlosing money. And the clients weren't made aware of the ways they were harming their\nown projects.\nWhen do we need to revisit the client during Perform?\nCommon occasions include:\n1. Discovering you need more information because the Accountable Agreement\nwasn't actually complete after all.\n2. Discovering you need more information because circumstances have changed.\nFor example, if they asked for a part, color, texture, etc. that has gone out of\nstock:\n1. Can they accept a substitute?\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 27 of 47\n\n-- 27 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n2. Can they tolerate a delay?\n3. Can they accept an extra charge to source the item elsewhere?\n3. Asking questions that were anticipated to be asked during this stage. \"Once we\nreach Milestone 3, we'll need to huddle and share what we discovered, and make\nthree choices before starting toward milestone 4.\"\nOnly the shortest and most trivial tasks are guaranteed to be free of the need for a Doer\nto ask the Asker for a clarification, a decision, or an authorization during\nPerform.\nFor this task of asking for help of the Asker during Perform, we've created a template\nthat often helps. Customize it to fit your work. We call it the Warm ABCs.\nComponents of the Warm ABCs protocol\nThe Doer asks the Asker:\n1. Warmly, because email and text have no tone of voice, you must make the effort\nto show you care about the other person\n2. Ask for what you Actually want (a decision, a clarification, an authorization,\netc.) and be sure to ask it explicitly at the top of the email. Use a subject line such\nas \"Request for Decision on Logo\"\n3. Be clear By When you need their response. Specify it using a \"Fully Qualified By\nWhen Statement\" consisting of the Day, Date, Time, and Time Zone:\n1. \"Please respond with your decision on the logo no later than Friday,\n02-Dec at 3 PM Pacific Time\"\n2. Use a three-letter abbreviation for the month, instead of the two digit\nnumber. We all know 2/3 and 3/2 are two different dates, but if your\ncommunications partner grew up in Canada, Europe, or pretty much\nanywhere outside the US, when you write 2/3 to mean 03-Feb, \"2/3\" will\nbe unconsciously interpreted by them as 02-Mar. They probably won't\neven ask for clarification, because it's unconscious. And now one of you is\ngoing to be a month early or late. This ambiguity is utterly avoidable.\nAvoid it by using \"DD-Mon\" format: 03-Feb and 02-Mar are universally\nrecognized.\n4. Include both the Context of the request, and the Consequences of getting it or\nnot getting what you’re requesting:\n1. This logo decision is now on the critical path for the project. If I\nsuccessfully receive your decision on time, I'll be able to order the printed\nitems as scheduled. Any delay in receiving the decision will cause us to\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 28 of 47\n\n-- 28 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nmiss our window and result in either a minimum 7 day delay in printing,\nand thus delay the whole project, or will require a $6,000 rush fee.\n5. You might optionally include a \"what Silence means\" section. Here you can\nsay what you'll do if they don't reply by a given deadline. This is not always\nappropriate, but can work wonders in the right place.\n1. Example 1: “If I don't receive your decision on the graphics colors for the\nFacebook ad by 3 PM Pacific Time on the date mentioned above, I'll call\nyour cell phone. If I've not heard back by 3:30 PM, I will decide the colors\non your behalf, using my memory of our prior conversations, as authorized\nby you on page 4 of the Master Agreement.”\n2. Example 2: “If I don't receive your authorization by the above deadline, I'll\nplace your project on \"pause\" and release the workers to other projects.\nRestarting your project will require a minimum two week delay, and could\ntake longer depending on availability of resources.”\n3. Ask for a specific acknowledgment of your request, by when, with a reason.\ni. The main point of a Warm ABCs email is to ask for the thing you\nneed -- key information, a decision, an authorization, etc. This may\nnot be readily at hand. You don’t want to sit in silence and\nwonderment.\nii. So, in addition to asking for the Actual Thing You Need, also ask for\ncoordinating information. Say: \"Please reply by ____, so that\n____.\" For example: \"Please reply by noon tomorrow, even if you\ndon’t yet have the information I’ve requested, so that I know you’ve\nreceived this email and are working on it.\"\nOften, people tell me the clarity of the Warm ABCs makes them uncomfortable. Some of\nthe above language makes some of them \"feel like I'm threatening the client.\"\nBut it's not you threatening, it's the system threatening. It's reality threatening. If the\ndeadline is missed, the late fees occur. The project gets delayed. That's just a fact.\nAnd yet, it's true that some clients may feel insulted or threatened by this language. And\nthe Warm ABCs method cannot work if the user is afraid to use it. Nor should you use it\nif it might harm the relationship. What to do?\nIntroduce the Warm ABCs during onboarding\nThe answer is, as it often is in the Accountability Loop, to look upstream. Did we\nonboard the Asker to the Warm ABCs method during Negotiation? We could have, and\nwe should have.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 29 of 47\n\n-- 29 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nNote how different it feels to try to tell the client about a late fee during Perform, when\nsuch fees were never previously discussed... vs. reminding a client about a late fee that\nthey were told about and in fact agreed to, in writing, during Negotiate.\nIdeally during Negotiation you would show the client your custom version of the\nWarm ABCs template and some examples, and explain what communications they'll get\nfrom you during the Perform phase. Also, tell them all about late fees and other\nconsequences of delays in communication.\nMost clients find this sort of clarity and structure deeply reassuring. It marks you as a\nhighly prepared professional—someone they can count on to be Accountable for results.\nIn addition, the Warm ABCs provide you and your people with an error correction\nprotocol—a well-formatted and complete communication to course-correct during the\nPerform phase.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 30 of 47\n\n-- 30 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nPhase 4: Accept, Challenge, Forgive, and Learn\nThe final phase of the Accountability Loop is Accept. This Phase starts when the Asker\nhas been informed of work completion by the Doer. Now the Asker must inspect\nthe result and respond, informing the Doer if the Asker is content, or wishes for rework\nor changes.\nIt's also in the Accept phase that we find out if either party feels especially let down by\nthe other. If one feels the other has broken a significant promise, then it may be\nappropriate to use the Handle a Broken Promise routine to repair the relationship.\nAnd it's during Accept that we will use a Plus/Delta, Hot Wash or After Action\nReview routine to learn what went wrong or how we can do better next time, improving\nour next Initiation and Negotiation.\nBest practices for Accept include answering these questions:\n● Did I get the Outcome I truly needed?\n● Which expectations were met, and did I say “thank you”?\n● Which were NOT met, and did I challenge appropriately?\n● Plus/Delta: How do we improve our joint process?\n● How did I co-create the results (good and bad)?\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 31 of 47\n\n-- 31 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n● Do I need to initiate a Broken Promises conversation?\nHere's how to do each.\nDid I get the Outcome I truly needed?\nAs Asker, your role is to compare what you actually got with what you actually wanted,\nneeded, and/or asked for.\nThere's an old joke that software project sponsors will complain when their software is\ndelivered, saying \"it's exactly what I asked for, but it isn't what I want.\"\nThere's many a truth that's told in jest.\nAs Asker, now that you've received the Report that Performance is Complete, you need\nto step back from your initial request and ask yourself whether the Performance truly\nmeets your needs. (And if it doesn't, don't worry yet about whom to blame—this best\npractice is internal to you. Discussion of ‘blame’ comes later.)\nIt's possible that the output from Performance was more and better than what you asked\nfor. It's possible that the Doer gave you what you should have asked for, and ignored\nwhat you actually asked for. (I once disobeyed an assignment to write thousands of lines\nof hand-written code and instead wrote an automated code generator, because I knew\nmy Asker would be better off with a much smaller program that could flexibly solve\ncurrent and future problems.)\nIt's possible that the output from Performance, reflects a severe misunderstanding of\nwhat you wanted. Notice this; take no action yet.\nIt's possible that the output from Performance reflects a form of malicious\ncompliance. This is when a Doer carefully meets the letter of a request while\nundermining its intention. (Example: A software developer delivers exactly what was\nrequested in a ticket, even though it crashes the app — they knew it would, but were\npreviously punished when they tried to raise concerns.) Such things are usually carefully\nwrapped in layers of obfuscation such that the Doer cannot be easily blamed or\npunished. When the Doer is an employee or subordinate of the Asker, it's one form of\n\"counterproductive work behavior\" (CWB)—employee behavior that goes against the\nlegitimate interests of an organization.\nYour answer to the “did I get what I truly wanted” question should tell you\nwhether the output of Perform is better, worse, the same, or different vs\nwhat you'd intended to ask for. It's a vital answer to set up the rest of your work as\nAsker during the Accept phase.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 32 of 47\n\n-- 32 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nIn short, if you did get what you wanted, how can you ensure you'll get it again in the\nfuture?\nIf you did not get what you wanted, how can you learn from this experience to get better\nresults in the future?\nWhich expectations were met, and did I say “thank you”?\nAs Asker you need to give the Doer feedback on what worked well.\nAs Askers, we want our Doers to build on strengths and successes. Never assume your\nDoer can read your mind and knows which things were done to your satisfaction or\nbetter.\nMany Askers will ignore this, at their peril. If the Doer doesn't hear from you that some\npart of the Performance went well, the Doer may mistakenly think that that part is\nwrong or broken or that you don't care about it—and may change it next time, to your\ndisappointment.\nSome Askers like to take the stance that \"if I don't complain, you can assume it's fine.\"\nThat's both lazy and irresponsible.\nMy strong guidance is to always say \"thank you,\" and to acknowledge specifically what\nyou liked and what went well.\nWhich expectations were NOT met, and did I challenge appropriately?\nAs Asker you need to give the Doer feedback on what did NOT work well.\nAs Askers, we want our Doers to improve and grow, to meet our needs better and better.\nNever assume your Doer can read your mind and knows which things were NOT done to\nyour satisfaction or better, and what the nature of your discontent is.\nMany Askers will shrink from challenging the output of Perform, at their peril. If the\nDoer doesn't hear from you that some part of the Performance fails to meet your\nConditions of Satisfaction, the Doer may mistakenly think that part is just fine, or that\nyou don't care about it—and may repeat this error next time, to your disappointment.\nMany Doers know that some Askers take the stance that \"if I don't complain, you can\nassume it's fine.\" Given this context, your silence in the face of sub-par Performance will\nroutinely be interpreted by Doers as you implying that everything is fine. The doctrine\n\"silence implies consent\" operates here.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 33 of 47\n\n-- 33 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nMy strong guidance is to always Initiate and Negotiate in ways that normalize you\nchallenging your Doer during the Accept phase. That can be something as simple as\nsaying, \"When you deliver the output of Perform, I'd like to meet for 5 minutes and give\nyou explicit feedback on what meets my needs and anything that doesn't. Are you OK\nwith that?\"\nPlus/Delta: How do we improve our joint process?\nYou can cover both of the above by holding a formal \"Plus/Delta\" or \"hot wash\" or \"after\naction review\" meeting.\nThe word \"formal\" here just means you have a process you follow—it does not require\nthat the meeting be marked by ceremonial formality in the social sense.\nYou should have your own process for this. (Read more here.)\nRemember the Problem Log you were encouraged to keep during Perform? Here's\nwhere you turn that log of problems into meaningful solutions.\nHow did I co-create the results (good and bad)?\nWhen you're unhappy with your Doer or with the output of the Perform phase, it's rarely\n100% the Doer's fault, and it's rare that there's not some way you, as Asker, could\nengage more wisely or carefully next time.\nEven if your Doer turned out to be an outright thief, who took your money and ran,\ndelivering nothing, you could still learn from this—you could learn to ask more skeptical\nquestions, vet potential Doers more carefully, demand that they have insurance and a\nperformance bond, etc.\nIn more common cases of mere miscoordination, always look for ways you can\nanticipate or avoid the bad outcome next time. Make your mantra, “Next time better.”\nThis step is NOT about letting the other party off the hook. Just because you could have\nbeen more careful, does not mean the other person should feel they did a great job.\nOn the other hand, when things go very well, give yourself credit for preparing the way\nfor that success. Be sure you identify—and keep doing—the things that worked well.\nDo I need to initiate a Broken Promises conversation?\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 34 of 47\n\n-- 34 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nIn cases of severe under- or non-performance, as Asker you may feel that the Doer has\nbroken a promise—you may feel that you have to reassess your relationship with the\nDoer, or cut them out of future work.\nOr maybe as Asker you did not uphold your end in some way, and perhaps the Doer\nfeels betrayed.\nOr as the Doer you know you either underperformed your potential or under-delivered\nvs the prior Agreement, and you sense this deserves to be discussed so that your\nrelationship with your Asker isn’t harmed.\nHere’s what you should do when you’ve made a commitment and find you cannot keep\nit:\n1. Immediately notify the affected person that you won’t be delivering as\npromised—don’t make them find out the hard way, such as from another person,\nfrom rumor, or from your failure to deliver: “I’m calling you today, Tuesday, to\ntell you I won’t be done by noon on Thursday as I had previously said I would\nbe.”\n2. Optionally, explain briefly how YOU contributed to the problem (not what\nothers did): “I failed to allow enough time for my subcontractor to do the\nrevisions.” This is about your role—do NOT throw others under the bus.\n3. Demonstrate your compassion by stating in a sentence or two how you know\nthey are affected: “I know this puts you back and could shove you into\nworking on the weekend, or incurring overtime charges.”\n4. Re-promise: “I will have it in your hands by noon Friday.” Be sure this is a\ndeadline you can keep.\n5. Offer to help clean it up: “If you have to work the weekend, I’ll be in here with\nyou to help.” Or, “I’ll cover any overtime charges out of my budget, not yours.”\n6. Optionally, tell them your new commitment more generally: “You have my\ncommitment that in future I will check with the subcontractor about their\nturnaround time, rather than assuming it, and I will commit to being on time in\nthe future.”\nNone of these steps require the other person to be a high performer—all of these steps\nmark you as a high performer.\nIf the other person let you down, you can share this process and invite them to\nundertake it.\nAnd you can introduce this process during Initiate and Negotiate, so both parties know\nit.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 35 of 47\n\n-- 35 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 36 of 47\n\n-- 36 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nDownloadable Tools\nDownloadable tools (forms,\nchecklists, and infographic)\nassociated with the\nAccountability Protocol can be\naccessed at\ntxl-lab.com/manager-tools.\nThese include forms, job aids,\nand an 11 x 17-inch infographic\nposter covering 39 major points\nfrom this book.\nAfterword\nYou can access a YouTube playlist of videos for this content here or by searching for\n“Accountability Protocol”.\nMy curated reading list of excellent leadership and management books is here.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 37 of 47\n\n-- 37 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nAppendix I: Preconditions for Accountability\nWe know that we have Accountability when the Doer and the Asker both agree the Doer\ndid what the Asker asked for.\nSimple as this sounds, it won’t happen on its own -- preconditions must exist. Here are\nthe biggest.\nOwnership or Roles\nWe’ve all seen examples where work needs to be done, but nobody does it.\nSomeone proclaims that “cleaning the break room is everyone’s job!” -- all but\nguaranteeing that nobody will do it. Eventually, a few hardy folks (disgusted by the\nmess) will do it themselves spontaneously… but they eventually stop, feeling\nunappreciated and taken advantage of by the idle majority of free riders. Unassigned\nand unowned work doesn’t get done.\nLess visible and possibly more toxic is Role Confusion. Wilma is convinced that it’s\nBetty’s job to clean the break room, but it doesn’t get cleaned. Betty has no clue Wilma\nthinks this -- nobody ever asked Betty explicitly to take that work on. Wilma may drop\nhints or gossip. But until someone gets explicit about the expectations, Wilma will walk\naround upset, Betty will feel vaguely disapproved of and uncomfortable… and nobody\ncleans the break room.\nThe Asker and Doer need to have a shared understanding that there’s work to be done,\nand either they both know the Asker has a role that empowers them to ask the Doer to\ndo it, or the two have a relationship that supports this request, or they both know that\nthe Doer has a role that includes this work.\nWhen I was a busboy, I fully expected any waitress to feel free to ask me to clean any\ntable -- not because I reported to them, but because it was my job to clean tables, and I\nwanted them to support me by pointing me at specific tables they wanted cleaned.\nI also fully expected my boss to assign me tasks outside of my normal routine, like\npicking up trash in the parking lot. Not because that was part of my job description (it\nwasn’t), but because my boss had the right to assign work to me.\nI also fully expected any customer to ask me for random things like a water refill -- not\nbecause I was a waiter, but because I was a representative of the restaurant, and it was\nall of our jobs to do reasonable things for our customers.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 38 of 47\n\n-- 38 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nBefore you embark on an Accountability journey, be sure your roles are clear. If you see\nproblems with Accountability, check for role clarity and ownership of results.\nEOS’s Accountability Chart and Apple’s DRI\nUsers of the Entrepreneurial Operating System (EOS) are familiar with the\n“Accountability Chart” which lists all the work needed to run the firm, and allocating\nresponsibility for each major function to exactly one person.\nA similar approach is the Directly Responsible Individual (DRI) standard adopted by\nApple.\nThe common theme is that “shared accountability is no accountability” -- that everyone\nneeds to know there is one person accountable for ensuring that a given function is\nperformed -- even when they may delegate some or all of the work of that function.\nThese are specific examples of establishing role ownership.\nBasic Trust\nThe Accountability Protocol only works when the Asker and Doer have some baseline\nlevel of mutual trust. This level of basic trust doesn’t need to be all that hight. Even\npeople who might normally mistrust each other can still come together and cooperate\neffectively. (Think of the World War I Christmas cease-fires that happened\nspontaneously up and down the trenches.)\nIf you see problems with Accountability, and it’s not caused by lack of ownership, check\nfor a lack of basic trust. (If two people mistrust one another enough to derail their ability\nto cooperate, at least one of them will be eager to tell you.)\nClarity (Context)\nIn his book Conversations for Action (the inspiration for The Accountability Protocol),\nFernando Flores referred to the need to share a “context of obviousness.”\nThe Asker and the Doer need to share enough clarity and context to understand the\nrequests being made and the agreement or expectation they are creating.\nIf you see problems with Accountability, and the two actors have perhaps never worked\ntogether or haven’t done this task before, check for a lack of clarity around context.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 39 of 47\n\n-- 39 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nFor example, a client related how a nurse called out from a treatment room for a piece of\nequipment, using a calm tone and without using the key word “stat” meaning “right\naway” or “urgently.” A few minutes later this nurse was raging that a patient was dying\nand they needed the equipment now. During the after-action review, the nurse\nexplained that, given what room she was in when she asked, it should have been obvious\nthat the need was urgent -- nobody would ask for that equipment in that context without\nit being urgent. So she didn’t feel she needed to say “stat.” The other staff obviously\ndidn’t share this understanding. (The patient lived.) This is an example of a lack of\nshared context leading to a breakdown in performance.\nMental Fitness (non-victimhood)\nAll humans can be thought of as operating in three major mental-emotional states or\nmodes:\n● Sage mode, where one is especially calm, curious, and empathic. That person\ntends to bring others into a similar state -- this is a peak-performance state.\n● Sabotaged mode, where one is hijacked into a state of fear (or anger), and one\ntends to bring others into a similar state. An angry boss can quickly create fear in\nsubordinates. This is a low-performance state.\n● Neutral mode, where people are neither in Sage mode nor Sabotaged.\nFor as long as neither of our actors -- Asker and Doer -- are Sabotaged (they are in\nNeutral or Sage mode), the Accountability Protocol can always be made to work.\nIf both are Sabotaged, the Accountability Protocol is unlikely to work. (But with\npractice, it’s possible.)\nIf only one is Sabotaged, results vary. If the Sagier actor has strong mental fitness, they\ncan often perform well despite their partner’s state of Sabotage, and may even help\nelevate that person into Neutral or Sage mode.\nWhile dealing with Sabotaged individuals in general is beyond the scope of this book, we\ninclude the concept because it represents a boundary condition where the Protocol will\ncease to function.\nIn other words, a precondition for reliable usage of the Accountability Protocol is that\nthe two actors be Neutral or better. If you see breakdowns, you may need to check for\nSabotage.\nDetailed examples of specific ways the Nine Saboteurs can derail Accountability are\nincluded in another Appendix.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 40 of 47\n\n-- 40 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nDoability\nThe work being requested by the Asker must be Doable by the Doer.\nAn optimistic or naive Doer (or one who has been hijacked by a Pleaser Saboteur and is\nmotivated to please rather than to make a well-grounded commitment) may say “yes”\ndespite the non-doability of the task, or before confirming doability.\n(I once unsuccessfully tried to coach a young attorney who said “yes” to every request,\nand who was on probation for non-performance. He said he felt he had no choice but to\nsay “yes” to every request, and that he could not ask clarifying questions, and could not\nask for help. This was despite his boss wanting him to ask questions, ask for help, and\nget prioritization from superiors. He was so attached to this belief that he refused to use\nthe Accountability Protocol, refused to ask questions, and he was ultimately fired for his\ninability to follow through on his commitments.)\nSee the chapter on the Negotiate phase, where Doability must be confirmed.\nIt is a precondition for the Accountability Protocol to work that the task being requested\nbe doable by the Doer, and that the Doer be empowered to ask questions and make\ngrounded commitments.\nOther Useful Frameworks for Accountability\nMany readers may be familiar with prior work on the topic of (or adjacent to)\nAccountability, its desirability, and how to increase it.\nHere are some of the top titles and how their core messages may complement your use\nof the Accountability Protocol.\n1. Positive Intelligence by Shirzad Chamine - specific, science-based guidance on\nexactly how to deal with Saboteurs and reliably enter the Sage mode at will. I\ntypically teach this before I teach the Accountability Protocol.\n2. Extreme Ownership by Jocko Willink and Leif Babin - ideal for anyone leading a\nsmall team who wants a pep talk on preparation, training, and taking full\nresponsibility for outcomes. Military-focused with lots of anecdotes.\n3. The 15 Commitments of Conscious Leadership by Dethmer et al. - gives useful\nsteps for living “above the line” (in Sage mode). Excellent complement to the\nAccountability Protocol.\n4. Dare to Lead by Brené Brown - clear guidance on mindfulness and mindset; can\nhelp you have highly trusting conversations about expectations. Useful for\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 41 of 47\n\n-- 41 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\npreparing a team for “clear is kind” conversations about performance. If you shy\naway from uncomfortable conversations, study this.\n5. Crucial Accountability by Patterson et al. – blends behavioral science with\npractical tools. It emphasizes managing one’s emotions during accountability\nconversations. Useful for the Accept phase of the Protocol, and handling joint\naccountability without blame, shame, or retreat.\n6. Turn the Ship Around by David Marquet - the single best book on the nuts and\nbolts of delegation, for when you’re ready to scale accountability upward to larger\nspans of responsibility.\nSpecial Conditions: The Monkey’s Paw,\nWork-to-Rule, and Contracts\nThere are boundaries beyond which you shouldn’t rely on the Accountability Protocol.\nIn the classic short story The Monkey’s Paw by W.W. Jacobs, a family is given three\nwishes, but they find the source is dangerous and perhaps malicious. The first wish, for\nmoney, is fulfilled when the couple’s son is killed in a workplace accident, and the\ncompany pays a death benefit in the exact amount they wished for. (The story gets worse\nfrom there.)\nThe Accountability Protocol won’t protect you from a malicious partner.\nSimilarly, employee unions that are legally prohibited from striking sometimes engage\nin a job action known as “work-to-rule” where every instruction is followed to the letter,\nand every job description is obeyed precisely. Nobody goes beyond the minimum\nrequired by the written rules, and even obscure or outdated rules are obeyed\nscrupulously. Work slows precipitously.\nHere, too, the Accountability Protocol is helpless. It requires two actors working in good\nfaith and without another agenda.\nLastly, there’s a structural similarity between the Protocol and contract law. Legal\ncontracts require a structure, two (or more) parties, an agreement, performance, etc.\nLegal agreements and contracts are a vital part of a functioning society.\nThe Accountability Protocol is a cooperative tool meant for the 90% of cases where an\nAsker and a Doer can get by without a contract. It’s great when the two are trying to\nfigure out why their expectations aren’t being met the way they’d like, and they want to\ndebug and improve their working relationship.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 42 of 47\n\n-- 42 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nWhen an agreement for performance passes a certain threshold for value, risk,\ncomplexity, or a need for enforceability and clarity, please get a legal contract.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 43 of 47\n\n-- 43 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nAppendix II: Nine Saboteurs of Accountability\nAs taught by Shirzad Chamine in Positive Intelligence, there are exactly nine specific\nand harmful ways our brains react to anxiety in ways that cause self-sabotage. This\nappendix looks at how those patterns manifest specifically during an Accountability\nLoop.\nEvery Saboteur represents the mis-use of a core character strength, hijacked by anxiety.\nWhen you can spot these patterns in yourself or others, you can use mindfulness\ntechniques to interrupt the Saboteur-driven self-sabotage pattern, address the anxiety\nconstructively, salvage the loop, and improve the relationship.\n1. Avoider\n● Reacts to anxiety by hiding from facts, tasks, or conversations\n● Asker: Fails to challenge weak yeses; avoids giving tough feedback.\n● Doer: Doesn’t ask for help or clarification, hoping problems go away.\n● This is a misuse of: easy-going flexibility and adaptability.\n● Mitigation: ask “What’s needed now?” and create a small next action. Practice\nsitting in discomfort and facing it without blame.\n2. Controller\n● Reacts to anxiety by trying to control everything.\n● Asker: Dictates methods instead of negotiating outcomes; micromanages during\nPerform. May be confrontational and harm relationships.\n● Doer: Inflexible during Negotiate; Refuses input or changes during Perform.\n● This is a misuse of: action orientation, decisiveness, and willful persistence.\n● Mitigation: ask “What would make this more of a pull than a push?” Invite the\nDoer to co-create the Conditions of Satisfaction with you. Ask for advice or\nsuggestions. Lean into the Doer’s expertise.\n3. Hyper-Achiever\n● Reacts to anxiety by seeking validation through achievement.\n● Asker: Cares more about optics than clarity; values speed over alignment. May\nunder-invest in the relationship. May over-identify with success (vs learning).\n● Doer: Agrees to everything for the gold star, then burns out or underdelivers. Can\nover-focus on looking good and impressing others. Can lack reflection.\n● Is a misuse of: practical, goal-oriented self-direction\n● Mitigation: seek to enjoy the process and focus less on a given outcome.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 44 of 47\n\n-- 44 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n4. Hyper-Rational\n● Reacts to anxiety by over-using logic and analysis, dismissing relational needs,\ncontext, or emotions in the Loop. Can under-serve emotional needs.\n● Asker: Ignores people’s needs or fails to onboard stakeholders.\n● Doer: Doesn’t communicate during Perform; treats human input as noise.\n● Is a misuse of: analytic ability, insightfulness, and objectivity.\n● Mitigation: Use the Wheel of Emotion to name the feelings one notices;\nremember that honoring emotional needs will make customers happier.\n5. Hyper-Vigilant\n● Reacts to anxiety by flooding the Loop with fear and overpreparing; breeds even\nmore anxiety.\n● Asker: Over-specifies; re-checks everything; never trusts completion.\n● Doer: Hoards updates; tries to pre-defend every move; loses focus.\n● Is a misuse of: appropriate awareness of risks and dangers.\n● Mitigation: Use the Eisenhower Matrix; only sweat bigger stuff.\n6. Pleaser\n● Reacts to anxiety by attempting to purchase goodwill by over-giving, giving a\n“weak Yes”, and not attending to one’s own legitimate needs (leading to both\nbreakdowns and resentment).\n● Asker: Avoids making real requests; over-apologizes or over-explains.\n● Doer: Says yes when they mean no or still need more information; avoids\nrenegotiating when stuck.\n● Is a misuse of: empathy, love, and the desire for connection and service.\n● Mitigation: ask oneself “What would please me?” and remember to work on a\nlonger time horizon -- the weak Yes always leaves everyone unhappy.\n7. Stickler\n● Reacts to anxiety by: Focusing on trivial precision instead of the core agreement.\n● Asker: Demands perfection in low-value areas; nitpicks Deliverables.\n● Doer: Gets stuck perfecting formatting while missing the big picture.\n● Is a misuse of: high standards of excellence and attention to detail.\n● Mitigation: realize 80% of work need only be done “well enough.”\n8. Restless\n● Reacts to anxiety by: task switching; starting new Loops before closing existing\nones.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 45 of 47\n\n-- 45 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\n● Asker: Initiates poorly; drops the ball on Accept. Doesn’t stay engaged in the\nLoop.\n● Doer: Jumps ahead before checking alignment; misses renegotiation needs;\ndrops the ball during Perform because Squirrel!\n● Is a misuse of: openness, curiosity, and spontaneity.\n● Mitigation: use mindfulness techniques to focus 100% on what is directly in front\nof you; practice sitting in discomfort and breathing through it without\ntask-switching.\n9. Victim\n● Reacts to anxiety by: Seeing every failure as personal; avoids ownership; seeks\nexcuses and special exemptions.\n● Asker: Feels powerless to hold others accountable; may use victim narrative to try\nto control outcomes, alienating the Doer.\n● Doer: Melts down when challenged; takes feedback as attack; may blame\nsubcontractors and refuse to “own their inputs”.\n● Is a misuse of: sensitivity to emotion and the ability to introspect deeply and\ncourageously.\n● Mitigation: give yourself the love you need (rather than seeking it from others via\nthe victim narrative); use the Find the Gift technique to stay in the driver’s seat.\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 46 of 47\n\n-- 46 of 47 --\n\nThe Accountability Protocol eBook by Thomas Cox - July 2025 Edition\nAcknowledgment\nI want to acknowledge the incredible contributions of Fernando Flores and Terry\nWinograd, creators of the “Language/Action Perspective” (1987), which inspired this\nwork. Also Fernando Flores’s essays in Conversations for Action (2013) was a major\nsource for this material. Other influences include The Oz Principle by Hickman, Smith,\nand Connors (1998) and Winning with Accountability: The Secret Language of\nHigh-Performing Organizations (2008) by Henry Evans.\nI’m deeply grateful to Mark Horstman of manager-tools.com whose influence is visible\nthroughout this book, including phrases like “own your inputs” and “next time better.”\nHe doesn’t know he saved my career.\nI’m indebted to my wife Tess Daniel, my business partner Jim Prinzing, and countless\nothers who have questioned, tested, and improved this work.\nThomas B. Cox\nthomas@eudae.biz and thomas@txl-lab.com\n+1.503.308.1233\nhttps://txl-lab.com \tCopyright © 2024-2025 Eudae LLC. All rights reserved. \tPage 47 of 47\n\n-- 47 of 47 --\n\n",
      "painPoints": null,
      "solutionSteps": null,
      "proof": null,
      "createdAt": "2025-12-04T22:18:43.991+00:00",
      "updatedAt": "2025-12-05T18:51:46.175+00:00"
    }
  ]
]
